ranjithaguna/pv/LED_Demo/source/pic32cx/component/dma_chan02.h
#define DMA_CHAN02_INT_STATUS_RESETVALUE    (0x00U)                                       /**<  (DMA_CHAN02_INT_STATUS) DMA Channel N Interrupt Status  Reset Value */

#define DMA_CHAN02_INT_STATUS_BUS_ERROR_Pos   (0)                                            /**< (DMA_CHAN02_INT_STATUS) This is an interrupt source register. This flags when there is an Error detected over the internal 32-bit Bus.\n                  1: Error detected. (R/WC) Position */
#define DMA_CHAN02_INT_STATUS_BUS_ERROR_Msk   (0x1U << DMA_CHAN02_INT_STATUS_BUS_ERROR_Pos)  /**< (DMA_CHAN02_INT_STATUS) This is an interrupt source register. This flags when there is an Error detected over the internal 32-bit Bus.\n                  1: Error detected. (R/WC) Mask */
#define DMA_CHAN02_INT_STATUS_FLOW_CONTROL_Pos (1)                                            /**< (DMA_CHAN02_INT_STATUS) This is an interrupt source register. This flags when the DMA Channel has encountered a Hardware Flow Control Request\n     after the DMA Channel has completed the transfer. This means the Master Device is attempting to overflow the DMA.\n                  1=Hardware Flow Control is requesting after the transfer has completed\n                  0=No Hardware Flow Control event Position */
#define DMA_CHAN02_INT_STATUS_FLOW_CONTROL_Msk (0x1U << DMA_CHAN02_INT_STATUS_FLOW_CONTROL_Pos)  /**< (DMA_CHAN02_INT_STATUS) This is an interrupt source register. This flags when the DMA Channel has encountered a Hardware Flow Control Request\n     after the DMA Channel has completed the transfer. This means the Master Device is attempting to overflow the DMA.\n                  1=Hardware Flow Control is requesting after the transfer has completed\n                  0=No Hardware Flow Control event Mask */
#define DMA_CHAN02_INT_STATUS_DONE_Pos        (2)                                            /**< (DMA_CHAN02_INT_STATUS) This is an interrupt source register. This flags when the DMA Channel has completed a transfer successfully on its side.\n     A completed transfer is defined as when the DMA Channel reaches its limit; Memory Start Address equals Memory End Address.\n     A completion due to a Hardware Flow Control Terminate will not flag this interrupt.\n                  1=Memory Start Address equals Memory End Address\n                  0=Memory Start Address does not equal Memory End Address Position */
#define DMA_CHAN02_INT_STATUS_DONE_Msk        (0x1U << DMA_CHAN02_INT_STATUS_DONE_Pos)       /**< (DMA_CHAN02_INT_STATUS) This is an interrupt source register. This flags when the DMA Channel has completed a transfer successfully on its side.\n     A completed transfer is defined as when the DMA Channel reaches its limit; Memory Start Address equals Memory End Address.\n     A completion due to a Hardware Flow Control Terminate will not flag this interrupt.\n                  1=Memory Start Address equals Memory End Address\n                  0=Memory Start Address does not equal Memory End Address Mask */
#define DMA_CHAN02_INT_STATUS_Msk             (0x00000007UL)                                 /**< (DMA_CHAN02_INT_STATUS) Register Mask  */

/* -------- DMA_CHAN02_INT_EN : (DMA_CHAN02 Offset: 0x18) (R/W 8) DMA CHANNEL N INTERRUPT ENABLE -------- */

typedef union
{
  struct
  {
    uint8_t  STATUS_ENABLE_BUS_ERROR:1;  /**< bit:      0  This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt */
    uint8_t  STATUS_ENABLE_FLOW_CONTROL:1;  /**< bit:      1  This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt */
    uint8_t  STATUS_ENABLE_DONE:1;      /**< bit:      2  This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt */
    uint8_t  :5;                        /**< bit:   3..7  Reserved                                      */
  };
  uint8_t  w;
} __DMA_CHAN02_INT_EN_bits_t;
#define DMA_CHAN02_INT_EN_RESETVALUE        (0x00U)                                       /**<  (DMA_CHAN02_INT_EN) DMA CHANNEL N INTERRUPT ENABLE  Reset Value */

#define DMA_CHAN02_INT_EN_STATUS_ENABLE_BUS_ERROR_Pos (0)                                            /**< (DMA_CHAN02_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN02_INT_EN_STATUS_ENABLE_BUS_ERROR_Msk (0x1U << DMA_CHAN02_INT_EN_STATUS_ENABLE_BUS_ERROR_Pos)  /**< (DMA_CHAN02_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN02_INT_EN_STATUS_ENABLE_FLOW_CONTROL_Pos (1)                                            /**< (DMA_CHAN02_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN02_INT_EN_STATUS_ENABLE_FLOW_CONTROL_Msk (0x1U << DMA_CHAN02_INT_EN_STATUS_ENABLE_FLOW_CONTROL_Pos)  /**< (DMA_CHAN02_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN02_INT_EN_STATUS_ENABLE_DONE_Pos (2)                                            /**< (DMA_CHAN02_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN02_INT_EN_STATUS_ENABLE_DONE_Msk (0x1U << DMA_CHAN02_INT_EN_STATUS_ENABLE_DONE_Pos)  /**< (DMA_CHAN02_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN02_INT_EN_Msk                 (0x00000007UL)                                 /**< (DMA_CHAN02_INT_EN) Register Mask  */

/** \brief DMA_CHAN02 register offsets definitions */
#define DMA_CHAN02_DMA_CHANNEL_ACTIVATE_OFFSET (0x00)         /**< (DMA_CHAN02_DMA_CHANNEL_ACTIVATE) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. Offset */
#define DMA_CHAN02_MEMORY_START_ADDRESS_OFFSET (0x04)         /**< (DMA_CHAN02_MEMORY_START_ADDRESS) This is the starting address for the Memory device. Offset */
#define DMA_CHAN02_MEMORY_END_ADDRESS_OFFSET (0x08)         /**< (DMA_CHAN02_MEMORY_END_ADDRESS) This is the ending address for the Memory device. Offset */
#define DMA_CHAN02_DEVICE_ADDRESS_OFFSET (0x0C)         /**< (DMA_CHAN02_DEVICE_ADDRESS) This is the Master Device address. Offset */
#define DMA_CHAN02_CONTROL_OFFSET    (0x10)         /**< (DMA_CHAN02_CONTROL) DMA Channel N Control Offset */
#define DMA_CHAN02_INT_STATUS_OFFSET (0x14)         /**< (DMA_CHAN02_INT_STATUS) DMA Channel N Interrupt Status Offset */
#define DMA_CHAN02_INT_EN_OFFSET     (0x18)         /**< (DMA_CHAN02_INT_EN) DMA CHANNEL N INTERRUPT ENABLE Offset */

/** \brief DMA_CHAN02 register API structure */
typedef struct
{  /* DMA Channel 00 Registers */
  __IO  __DMA_CHAN02_DMA_CHANNEL_ACTIVATE_bits_t DMA_CHANNEL_ACTIVATE; /**< Offset: 0x00 (R/W   8) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. */
  __IO  __DMA_CHAN02_MEMORY_START_ADDRESS_bits_t MEMORY_START_ADDRESS; /**< Offset: 0x04 (R/W  32) This is the starting address for the Memory device. */
  __IO  __DMA_CHAN02_MEMORY_END_ADDRESS_bits_t MEMORY_END_ADDRESS; /**< Offset: 0x08 (R/W  32) This is the ending address for the Memory device. */
  __IO  __DMA_CHAN02_DEVICE_ADDRESS_bits_t DEVICE_ADDRESS; /**< Offset: 0x0C (R/W  32) This is the Master Device address. */
  __IO  __DMA_CHAN02_CONTROL_bits_t    CONTROL;       /**< Offset: 0x10 (R/W  32) DMA Channel N Control */
  __IO  __DMA_CHAN02_INT_STATUS_bits_t INT_STATUS;    /**< Offset: 0x14 (R/W   8) DMA Channel N Interrupt Status */
  __IO  __DMA_CHAN02_INT_EN_bits_t     INT_EN;        /**< Offset: 0x18 (R/W   8) DMA CHANNEL N INTERRUPT ENABLE */
} dmachan02_registers_t;
/** @}  end of DMA Channel 00 Registers */

#endif /* _PIC32CX_0525SG12_DMA_CHAN02_COMPONENT_H_ */
